/*
 * Click nbfs://nbhost/SystemFileSystem/Templates/Licenses/license-default.txt to change this license
 * Click nbfs://nbhost/SystemFileSystem/Templates/Classes/Class.java to edit this template
 */
package pack2;

/**
 *
 * @author user
 */
public class Q {
    /*
    Q1 :
قم بتبديل قيم متغيرين بين بعضهما البعض

Q2:
قم بانشاء سلسلة فيبوناتشي بدءا من ال 0 و ال 1
 f(n) = f(n-1)+ f(n-2);
 f(0)=0
 F(1)=1
 F(2)=1
 F(3)=f(2)+f(1)=2
 F(4)=2+1=3
 F(5)=3+2=5

Q3 :
قم بطباعة اخر خانة لرقم int

Q4 :
 قم بتغيير قيمة متغير من 2 خانة الى معكوس خاناته
بدون استخدام عملية باقي القسمة
مع استخدام عملية باقي القسمة

Q5 :
قم بتغيير قيمة متغير من 3 خانات الى معكوس خاناته

Q6 :
التحقق من ان رقم زوجي او فردي.

Q7 :
ناتج قسمة عدد على 100 بدون فقدان اي قيمة كسرية

Q8 :
 int a,b,c,d;
 double e;
 e=(a/b+1)*(c/d) ناتج هذه العملية بدون فقدان اي قيم كسرية

Q9 :
التحقق من عدد الاحرف الموجودة بين حرفين عشوائيين

Q10:
قم بطباعة الكاراكترز الخمسة الاولى بعد الرقم 65 

Q11 - تحقق اذا كان الكاراكتر المعطى هو واحد من هذه A or E or U or O

اوجد القيمة التقريبية للرقم المعطى
    // ( 146 => 150, 143 => 140 . 145 => 150) 

Q12 - اوجد الكاراكتر الناتج عن جمع كاراكترين





    */
}
